Documents/СборГрафиковОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СборГрафиковОтпусков</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборЗапущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСбораГрафиковОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневойСборГрафиков</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборГрафиковОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаСбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторСбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСотрудников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборАннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАннулирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаАннулирование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внешний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСбора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланияСотрудниковВидныТолькоОтветственному</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКорневойСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СостоянияСбораГрафиковОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСбораГрафиковОтпусков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СборГрафиковОтпусков/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КонтейнерОшибок = Неопределено;

	ПроверитьЗаполнениеРеквизитовШапки(КонтейнерОшибок);		
		
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(КонтейнерОшибок, Отказ);
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") Тогда
		
		Если СборЗапущен Тогда
			
			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Пометка на удаление %1 кампаний по сбору графиков не предусмотрена. %2'"),
				?(СборЗавершен или СборАннулирован, ?(СборАннулирован, "аннулированных", "завершенных"), "начатых"),
				?(СборЗавершен или СборАннулирован, "", "Для отмены кампании следует использовать механизм аннулирования сбора."));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
			
		ИначеЕсли ЗначениеЗаполнено(КорневойСборГрафиков) Тогда
			
			ТекстСообщения = НСтр("ru = 'Пометка на удаление сборов графиков по подразделению не предусмотрена. Для отмены предусмотрен механизм аннулирования кампании по сбору графиков отпусков.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ЭтоКорневойСбор = Не ЗначениеЗаполнено(КорневойСборГрафиков);
	
	Если ЭтоКорневойСбор И ЗначениеЗаполнено(СуществующийДокументНаУказанныйГод()) Тогда
		ШаблонСообщения = НСтр("ru = 'На %1 год уже введен документ Сбор графиков отпусков.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Формат(Год, "ЧГ=")); 
		Если Внешний Тогда
			ВызватьИсключение ТекстСообщения;
		Иначе
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		ИдентификаторДокумента = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	УстановитьСостояниеКорневогоСбораГрафиков();
	УстановитьКоличествоСотрудников();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УстановитьГодПоУмолчанию();
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьГодПоУмолчанию()

	Год = Год(ТекущаяДатаСеанса());
	
КонецПроцедуры

Процедура УстановитьСостояниеКорневогоСбораГрафиков()
	
	Если ЭтоКорневойСбор Тогда
		Если СборАннулирован Тогда
			Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Отказано;
		ИначеЕсли СборЗавершен Тогда
			Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Утверждено;
		ИначеЕсли СборЗапущен Тогда
			Если СборПоПодразделениям Тогда
				Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.ВРаботе;
			Иначе
				Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Черновик;
			КонецЕсли;
		Иначе
			Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Черновик;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьКоличествоСотрудников()
	
	Если ЗначениеЗаполнено(КорневойСборГрафиков) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
		Запрос.Текст =     
		"ВЫБРАТЬ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	&Сотрудники КАК Сотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТСотрудники.ФизическоеЛицо) КАК ЗапланировалоОтпуск
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники";

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КоличествоСотрудников = Выборка.ЗапланировалоОтпуск;
		Иначе
			КоличествоСотрудников = 0;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры        

Процедура ПроверитьЗаполнениеРеквизитовШапки(КонтейнерОшибок)
	
	Если Не ЗначениеЗаполнено(КорневойСборГрафиков) Тогда
		Если Не ЗначениеЗаполнено(ИнициаторСбора) И Не СборЗапущен Тогда
			ТекстСообщения = НСтр("ru = 'Не указан инициатор сбора графиков отпусков.'");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ИнициаторСбора", ТекстСообщения);
		ИначеЕсли Не ЗначениеЗаполнено(Год) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан год сбора графиков отпусков.'");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.Год", ТекстСообщения);
		Иначе
			СуществующийДокументНаУказанныйГод = СуществующийДокументНаУказанныйГод();
			Если ЗначениеЗаполнено(СуществующийДокументНаУказанныйГод) Тогда
				ШаблонСообщения = НСтр("ru='На указанный год уже введен документ'");
				ТекстСообщения = СтрШаблон("%1 %2", ШаблонСообщения, СуществующийДокументНаУказанныйГод);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.Год", ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Функция СуществующийДокументНаУказанныйГод()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ДокументСборГрафиковОтпусков.Ссылка) КАК СсылкаПредставление
	|ИЗ
	|	Документ.СборГрафиковОтпусков КАК ДокументСборГрафиковОтпусков
	|ГДЕ
	|	НЕ ДокументСборГрафиковОтпусков.ПометкаУдаления
	|	И НЕ ДокументСборГрафиковОтпусков.СборАннулирован
	|	И ДокументСборГрафиковОтпусков.Год = &Год
	|	И ДокументСборГрафиковОтпусков.Ссылка <> &Ссылка
	|	И ДокументСборГрафиковОтпусков.КорневойСборГрафиков = ЗНАЧЕНИЕ(Документ.СборГрафиковОтпусков.ПустаяСсылка)";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СсылкаПредставление")[0];
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
